In [1]:
import pandas as pd
import numpy as np
from tabulate import tabulate

### Connect Pandas to the database with this URL:

In [2]:
base = '~/Documents/Lighthouse-lab/lighthouse-data-notes/Week_2/w2-d2/pandas_exercises/imdb_pandas/'
file = 'titles.csv'
rel = './imdb_pandas/'
#titles = pd.read_csv(base + file) # absolute path
titles = pd.read_csv(rel + file) # relative path use the forward slash
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
file = 'cast.csv'
cast = pd.read_csv(base + file)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [4]:
titles['title'].value_counts()[:10]

Hamlet                  18
Carmen                  16
Macbeth                 15
The Outsider            12
Maya                    12
Othello                 11
Temptation              11
The Three Musketeers    11
Freedom                 11
Kismet                  11
Name: title, dtype: int64

In [5]:
titles['title'].value_counts()[:10].index.tolist()

['Hamlet',
 'Carmen',
 'Macbeth',
 'The Outsider',
 'Maya',
 'Othello',
 'Temptation',
 'The Three Musketeers',
 'Freedom',
 'Kismet']

### Which three years of the 1930s saw the most films released?

In [6]:
ranges = range(1930,1939)
titles_range_30 = titles.groupby(pd.cut(titles.year,ranges)).count()
print(titles_range_30)
titles_range_30.idxmax()

              title  year
year
(1930, 1931]    886   886
(1931, 1932]    936   936
(1932, 1933]    894   894
(1933, 1934]    966   966
(1934, 1935]   1054  1054
(1935, 1936]   1138  1138
(1936, 1937]   1196  1196
(1937, 1938]   1129  1129

title    (1936, 1937]
year     (1936, 1937]
dtype: interval

In [7]:
titles[titles['year'].between(1930,1939)].value_counts() # doesn't work

title                      year
Zwischen den Eltern        1938    1
Im Bann des Eulenspiegels  1932    1
Imputato, alzatevi!        1939    1
Impian di Bali             1939    1
Imperial Mail              1939    1
                                  ..
She Asked for It           1937    1
She                        1935    1
Shchors                    1939    1
Shazai Dongfang            1933    1
$10 Raise                  1935    1
Length: 10097, dtype: int64

### Count the number of films that have been released each decade over the history of cinema.

In [8]:
ranges = range(1880,2030,10)
print(ranges)
titles_range_30 = titles.groupby(pd.cut(titles.year,ranges)).count()
print(titles_range_30)
titles_range_30.idxmax()

range(1880, 2030, 10)
              title   year
year
(1880, 1890]      0      0
(1890, 1900]      7      7
(1900, 1910]     55     55
(1910, 1920]   7617   7617
(1920, 1930]   8490   8490
(1930, 1940]  10277  10277
(1940, 1950]   8675   8675
(1950, 1960]  13113  13113
(1960, 1970]  18166  18166
(1970, 1980]  18351  18351
(1980, 1990]  20746  20746
(1990, 2000]  22672  22672
(2000, 2010]  42247  42247
(2010, 2020]  61847  61847

title    (2010, 2020]
year     (2010, 2020]
dtype: interval

### Count the number of "Hamlet" films made each decade.

In [9]:
ranges = range(1880,2020,10)
ham = titles[(titles['title'].isin(['Hamlet']))]
print(tabulate(ham))

print(ham.groupby(pd.cut(ham['year'], ranges)).count()) # initially I was using titles.year but that doesn't work since they are not the same size
           
           #np.arange(1880,2020,10)))
# df.groupby(pd.cut(df["B"], np.arange(0, 1.0+0.155, 0.155))).sum()
#.groupby(pd.cut(titles.year,ranges))#.count()


#(titles['title'].isin(['Hamlet'])).groupby(pd.cut(titles.year,ranges)).count()

#print(titles_range_ham)
#titles_range_ham.idxmax()

------  ------  ----
  6009  Hamlet  1948
 45350  Hamlet  1990
 46721  Hamlet  1910
 92146  Hamlet  1976
 94355  Hamlet  1987
 94554  Hamlet  2000
 98554  Hamlet  1921
102919  Hamlet  2011
122704  Hamlet  1969
128388  Hamlet  1954
166410  Hamlet  1913
168965  Hamlet  2015
176069  Hamlet  2009
182970  Hamlet  1964
201291  Hamlet  1996
209878  Hamlet  1911
221479  Hamlet  1973
223568  Hamlet  2014
------  ------  ----
              title  year
year
(1880, 1890]      0     0
(1890, 1900]      0     0
(1900, 1910]      1     1
(1910, 1920]      2     2
(1920, 1930]      1     1
(1930, 1940]      0     0
(1940, 1950]      1     1
(1950, 1960]      1     1
(1960, 1970]      2     2
(1970, 1980]      2     2
(1980, 1990]      2     2
(1990, 2000]      2     2
(2000, 2010]      1     1

### Count the number of "Rustler" characters in each decade of the history of film.

In [10]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [11]:
ranges = range(1880,2020,10)
rus = cast[(cast['character'].isin(['Rustler']))]

rus_r = rus.groupby(pd.cut(rus['year'], ranges)).count()
#print(rus_r,'\n')
print(tabulate(rus_r, headers=cast.columns.values))

                title    year    name    type    character    n
------------  -------  ------  ------  ------  -----------  ---
(1880, 1890]        0       0       0       0            0    0
(1890, 1900]        0       0       0       0            0    0
(1900, 1910]        0       0       0       0            0    0
(1910, 1920]        0       0       0       0            0    0
(1920, 1930]        7       7       7       7            7    2
(1930, 1940]       87      87      87      87           87    0
(1940, 1950]       14      14      14      14           14    0
(1950, 1960]        9       9       9       9            9    1
(1960, 1970]        1       1       1       1            1    0
(1970, 1980]        9       9       9       9            9    9
(1980, 1990]        2       2       2       2            2    2
(1990, 2000]        5       5       5       5            5    5
(2000, 2010]        0       0       0       0            0    0

### Count the number of "Hamlet" characters each decade.

In [12]:
ranges = range(1880,2020,10)
ham_c = cast[(cast['title'].isin(['Hamlet']))]
ham_cr= ham_c.groupby(pd.cut(ham_c['year'], ranges)).count()
ham_cr

              title  year  name  type  character   n
year
(1880, 1890]      0     0     0     0          0   0
(1890, 1900]      0     0     0     0          0   0
(1900, 1910]      1     1     1     1          1   0
(1910, 1920]     27    27    27    27         27  26
(1920, 1930]      9     9     9     9          9   9
(1930, 1940]      0     0     0     0          0   0
(1940, 1950]     24    24    24    24         24  17
(1950, 1960]      1     1     1     1          1   1
(1960, 1970]     57    57    57    57         57  31
(1970, 1980]     19    19    19    19         19  11
(1980, 1990]     32    32    32    32         32  27
(1990, 2000]     92    92    92    92         92  84
(2000, 2010]     17    17    17    17         17  17

In [13]:
ham_cr['character']

year
(1880, 1890]     0
(1890, 1900]     0
(1900, 1910]     1
(1910, 1920]    27
(1920, 1930]     9
(1930, 1940]     0
(1940, 1950]    24
(1950, 1960]     1
(1960, 1970]    57
(1970, 1980]    19
(1980, 1990]    32
(1990, 2000]    92
(2000, 2010]    17
Name: character, dtype: int64

### What are the 11 most common character names in movie history?

In [14]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [15]:
cast['character'].value_counts()[:11]

Himself        19600
Dancer         12096
Extra          10953
Reporter        8154
Doctor          7436
Student         7177
Policeman       6883
Party Guest     6742
Nurse           6676
Bartender       6613
Minor Role      6255
Name: character, dtype: int64

In [16]:
cast['character'].value_counts()[:11].index.tolist()

['Himself',
 'Dancer',
 'Extra',
 'Reporter',
 'Doctor',
 'Student',
 'Policeman',
 'Party Guest',
 'Nurse',
 'Bartender',
 'Minor Role']

### Who are the 10 people most often credited as "Herself" in film history?

In [17]:
cast[cast['character'].isin(['Herself'])]['name'].value_counts(ascending=False,sort=True)[:10]

Queen Elizabeth II    11
Joyce Brothers         9
Margaret Thatcher      8
Mary Jo Pehl           7
Hillary Clinton        7
Joan Rivers            6
Sumie Sakai            6
Caroline Rhea          5
Kareena Kapoor         5
Marilyn Monroe         5
Name: name, dtype: int64

### Who are the 10 people most often credited as "Himself" in film history?

In [18]:
cast[cast['character'].isin(['Himself'])]['name'].value_counts(ascending=False,sort=True)[:10]

Adolf Hitler          100
Richard Nixon          46
Ronald Reagan          39
John F. Kennedy        34
Winston Churchill      24
Ron Jeremy             23
Benito Mussolini       23
George W. Bush         23
Martin Luther King     21
Bill Clinton           20
Name: name, dtype: int64

### Which actors or actresses appeared in the most movies in the year 1945?

In [19]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [20]:
cast[cast['year'].isin(['1945'])]['name'].value_counts(ascending=False,sort=True)

Emmett Vogan        39
Sam (II) Harris     32
Harold Miller       29
Bess Flowers        29
Frank O'Connor      27
                    ..
Tom (IV) O'Grady     1
Charles McMurphy     1
Rex Rossi            1
Anneliese Uhlig      1
Charles Dechamps     1
Name: name, Length: 7802, dtype: int64

### Which actors or actresses appeared in the most movies in the year 1985?

In [21]:
cast[cast['year'].isin(['1985'])]['name'].value_counts(ascending=False,sort=True)

Mammootty            22
Shakti Kapoor        21
Sukumari             20
Lou Scheimer         15
Mohanlal             15
                     ..
James (II) Hall       1
Nevra Serezli         1
William Ostrander     1
Janet (XXI)           1
Janet Cole Notey      1
Name: name, Length: 22609, dtype: int64

### How many roles Mammootty has played in each year of his career.

In [22]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [23]:
cast[cast['name'].isin(['Mammootty'])].groupby(['year']).count().head()#.shape[0]##value_counts(ascending=False,sort=True)

      title  name  type  character   n
year
1971      1     1     1          1   0
1980      2     2     2          2   2
1981      3     3     3          3   3
1982      7     7     7          7   7
1983     18    18    18         18  16

### What are the 10 most frequent roles that start with the phrase "Patron in"?

In [29]:
#cast['name'].isin([])
cast[cast['character'].str.contains('Patron in')]['character'].value_counts(ascending=False,sort=True)
# SQL - WHERE column_name LIKE '%s%'
# Python - column_name.str.contains('s')

Patron in Frisky Rabbit         16
Patron in Chinese Restaurant     9
Patron in the Coffee House       9
Patron in Billiard Parlor        5
Patron in restaurant             4
                                ..
Opera Patron in Audience         1
Patron in Bookstore              1
Patron in the bar                1
Bar Patron in White Shirt        1
Bar Patron in Blue Dress         1
Name: character, Length: 63, dtype: int64

SQL - WHERE column_name LIKE 's%'
Python - column_name.str.startswith('s')

    To find all the values from the series that ends with a pattern "s":

SQL - WHERE column_name LIKE '%s'
Python - column_name.str.endswith('s')

    To find all the values from the series that contains pattern "s":

SQL - WHERE column_name LIKE '%s%'
Python - column_name.str.contains('s')

For more options, check : https://pandas.pydata.org/pandas-docs/stable/reference/series.html

### What are the 10 most frequent roles that start with the word "Science"?

In [31]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [32]:
cast[cast['character'].str.startswith('Science')]['character'].value_counts(ascending=False,sort=True)

Science Teacher           60
Science Fair Student       9
Science Student            9
Science Fair Judge         6
Science Promo Cadet        5
                          ..
Science School Teacher     1
Science lover              1
Science Team Elder         1
Science Nerd               1
Science Apprentice         1
Name: character, Length: 69, dtype: int64

### Count number of n-values of the roles that Judi Dench has played over her career.

In [47]:
cast[cast['name'].isin(['Judi Dench'])]['n'].value_counts()

3.0     6
1.0     6
2.0     6
7.0     4
4.0     4
6.0     4
12.0    3
5.0     2
18.0    2
16.0    2
13.0    2
23.0    1
26.0    1
20.0    1
40.0    1
8.0     1
29.0    1
9.0     1
Name: n, dtype: int64

In [48]:
#help(pd.value_counts)pd.sort

### Count number of n-values of Cary Grant's roles through his career.

In [49]:
cast[cast['name'].isin(['Cary Grant'])]['n'].value_counts()

1.0     46
2.0     20
9.0      2
3.0      2
10.0     2
5.0      1
8.0      1
4.0      1
Name: n, dtype: int64

### Count number of n-value of the roles that Sidney Poitier has acted over the years.

In [57]:
(cast[cast['name'].isin(['Sidney Poitier'])]).groupby(['year']).count()#.head()

      title  name  type  character  n
year
1947      1     1     1          1  0
1950      1     1     1          1  1
1951      1     1     1          1  1
1952      1     1     1          1  1
1954      1     1     1          1  1
1955      1     1     1          1  1
1956      1     1     1          1  1
1957      4     4     4          4  4
1958      2     2     2          2  2
1959      1     1     1          1  1
1960      1     1     1          1  1
1961      2     2     2          2  2
1962      1     1     1          1  1
1963      1     1     1          1  1
1964      1     1     1          1  1
1965      4     4     4          4  4
1966      1     1     1          1  1
1967      3     3     3          3  3
1968      1     1     1          1  1
1969      1     1     1          1  1
1970      1     1     1          1  1
1971      2     2     2          2  2
1972      1     1     1          1  1
1973      1     1     1          1  1
1974      1     1     1          1  1
1975      2     2     2          2  2
1977      1     1     1          1  1
1988      2     2     2          2  2
1992      1     1     1          1  1
1997      1     1     1          1  1

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

In [58]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [70]:
cast_multi_ind = cast.set_index(['year','type','n']).sort_index(level=[0,1,2])

#c_ar = cast[cast['type'].isin(['actor'])]
#c_ar[c_ar['n'].isin([1])]

In [78]:
c1_male = cast_multi_ind.loc[(1950,'actor',1)]
c1_male

                                                    title                name  \
year type  n
1950 actor 1.0  Abbott and Costello in the Foreign Legion          Bud Abbott
           1.0                      Alitet ukhodit v gory    Andrei Abrikosov
           1.0                        Dos gallos de pelea        Luis Aguilar
           1.0                                Akher kedba    Farid Al Atrache
           1.0                          Vom Teufel gejagt         Hans Albers
...                                                   ...                 ...
           1.0                 Na Zha da zhan Hong Hai Er              Kai Yu
           1.0                  Jiggs and Maggie Out West            Joe Yule
           1.0                                  Zhukovsky       Yuri Yurovsky
           1.0                         Akdeniz korsanlari         Daver Y?ken
           1.0                                     Jezero  Milivoje Zivanovic

                            character
year type  n
1950 actor 1.0              Bud Jones
           1.0  Nikita Sergeevich Los
           1.0         Pancho Peralta
           1.0                  Samir
           1.0              Dr. Blank
...                               ...
           1.0        Red Boy, Na Cha
           1.0                  Jiggs
           1.0       N. E. Zhukovskiy
           1.0                  Davut
           1.0                  Petar

[626 rows x 3 columns]

In [79]:
c1_female = cast_multi_ind.loc[(1950,'actress',1)]
c1_female

                                            title                 name  \
year type    n
1950 actress 1.0                 Al son del mambo       Amalia Aguilar
             1.0                 La vida en broma       Amalia Aguilar
             1.0         La liga de las muchachas         Elsa Aguirre
             1.0                Una mujer decente         Elsa Aguirre
             1.0                Square Dance Katy     Barbara Jo Allen
...                                           ...                  ...
             1.0                     Stage Fright           Jane Wyman
             1.0              The Glass Menagerie           Jane Wyman
             1.0                U nikh est Rodina  Natalya Zashchipina
             1.0  Die lustigen Weiber von Windsor        Sonja Ziemann
             1.0                        Valentina         Olga Zubarry

                                   character
year type    n
1950 actress 1.0                       Reina
             1.0                      Amalia
             1.0                      Dorita
             1.0                  Rosa G?mez
             1.0                 Gypsy Jones
...                                      ...
             1.0                    Eve Gill
             1.0             Laura Wingfield
             1.0                Ira Sokolova
             1.0  Frau Fluth (Mistress Ford)
             1.0   Valentina Gonz?lez Garc?a

[281 rows x 3 columns]

In [80]:
c1_to = c1_male.shape[0] - c1_female.shape[0]
c1_to

345

In [81]:
cast.dtypes

title         object
year           int64
name          object
type          object
character     object
n            float64
dtype: object

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?

In [88]:
c2_male = cast_multi_ind.loc[(range(1950,1959),'actor',2)]
c2_male

                                          title                   name  \
year type  n
1950 actor 2.0                     Breakthrough              John Agar
           2.0             Primero soy mexicano           Luis Aguilar
           2.0  Der Mann, der sich selber sucht      Wolf Albach-Retty
           2.0              Zwei in einem Anzug      Wolf Albach-Retty
           2.0            The Fuller Brush Girl           Eddie Albert
...                                         ...                    ...
1958 actor 2.0               Devushka s gitaroy         Mikhail Zharov
           2.0                     Wolne miasto  Wlodzislaw Ziembinski
           2.0              Troe vyshli iz lesa        Valentin Zubkov
           2.0            Manhunt in the Jungle     Luis (III) ?lvarez
           2.0                 Salve sauegjeter            ?yvind ?yen

                            character
year type  n
1950 actor 2.0        Lt. Joe Mallory
           2.0  Doctor Rafael Fuentes
           2.0           Marius Aldon
           2.0             Otto Vogel
           2.0        Humphrey Briggs
...                               ...
1958 actor 2.0           Sviristinsky
           2.0          Postman Rajca
           2.0        Sergei Koshelev
           2.0                Aloique
           2.0    Asbj?rn, sauegjeter

[4059 rows x 3 columns]

In [89]:
c2_female = cast_multi_ind.loc[(range(1950,1959),'actress',2)]
c2_female

                                 title              name         character
year type    n
1950 actress 2.0  Law of the Panhandle        Jane Adams     Margie Kendal
             2.0           Outlaw Gold        Jane Adams      Kathy Martin
             2.0     Ritmos del Caribe    Amalia Aguilar            Magali
             2.0        Sobre las olas   Beatriz Aguirre            Lolita
             2.0           Lluvia roja      Elsa Aguirre             Elisa
...                                ...               ...               ...
1958 actress 2.0       In Love and War       Dana Wynter      Sue Trumbell
             2.0               Hyoheki   Fujiko Yamamoto            Minako
             2.0            Mister Iks   Marina Yurasova  Theodora Verdier
             2.0               Tabarin     Sonja Ziemann  Rosine Forestier
             2.0    Mono gia mia nyhta  Voula Zouboulaki              Anna

[4074 rows x 3 columns]

In [90]:
c2_to = c2_male.shape[0] - c2_female.shape[0]
c2_to

-15